Repository: edutec/s4aWeb
Catalog: devdocs/s4aWeb-translation-CA/s4aWeb-translation-CA-level2.tmx
Source language: en_us
Languages: ca

source: Marina Conde got her bachelor degree in Computer Science in the Technical University of Catalonia (UPC) in 2009, and graduated as a Computer Engineer in 2012 in the same university.
ca: Marina Conde es va diplomar en Enginyeria Tècnica en Informàtica de Gestió per la Universitat Politècnica de Catalunya (UPC) l'any 2009, on va continuar els estudis fins obtenir, l'any 2012, el títol d'Enginyeria Superior en Informàtica.

source: Changed pin 12 from standard servo to normal digital output
ca: Canviat el pin 12 de servo estàndard a sortida digital normal

source: Button, LED and keeping state
ca: Polsador, LED i conservació d'estat

source: S4A works with Arduino Diecimila, Duemilanove and Uno.
ca: S4A funciona correctament amb Arduino Diecimila, Duemilanove i Uno.

source: Added full compatibility with HTTP protocol (POST AND GET), you can now send messages to S4A and watch/modify variable values from an Internet browser (among other things).
ca: Afegida compatibilitat completa amb el protocol HTTP (POST i GET). Ara és possible enviar missatges a S4A i observar/modificar valors de variables des d'un navegador web (entre altres coses).

source: Take in account that this compatibility doesn't work both ways, so you won't be able to open an S4A project from within the original Scratch.
ca: Cal tenir en compte que aquesta compatibilitat no és bidireccional. No és possible obrir projectes de S4A des de l'Scratch original.

source: Elisava Workshop Materials 2011
ca: Materials Taller Elisava 2011

source: To use it, follow the instructions below:
ca: Per utilitzar-lo, seguiu aquestes instruccions:

source: Fixed bug related to persistent message error when stopping and resuming connection with the board
ca: Arreglat bug relacionat amb un error persistent en aturar i reemprendre la connexió amb la placa

source: The interface
ca: La interfície

source: IMPORTANT! Both S4A as HiS4A must be connected to the same local network!
ca: IMPORTANT! Tant S4A com HiS4A han d'estar connectats a la mateixa xarxa local!

source: This firmware is a piece of software you need to install into your Arduino board to be able to communicate with it from S4A.
ca: Aquest firmware és un programa que cal instal·lar a la vostra placa Arduino per tal de poder-vos-hi comunicar des d'S4A.

source: Connect your Arduino board to a USB port in your computer
ca: Connecteu la placa Arduino a un port USB del vostre ordinador

source: Jose studied advanced telecommunications engineering, but started working at a publishing firm before completing his degree.
ca: En Jose va estudiar Enginyeria Superior en Telecomunicacions, però va començar a treballar a una editorial abans d'acabar els estudis.

source: It is possible to connect to multiple boards at the same time by just adding a new Arduino sprite.
ca: Es poden connectar múltiples plaques alhora. Només cal afegir un nou sprite Arduino.

source: An S4A program to control a light-sensor Theremin, with record and playback capabilities
ca: Un programa de S4A per a controlar un Theremin de llum, amb capacitat de gravació i reproducció

source: Connectivity
ca: Connectivitat

source: Arduino objects offer blocks for the basic microcontroller functionalities, analog and digital writes and reads, and also for higher level ones.
ca: Els objectes Arduino proporcionen blocs per a les funcionalitats bàsiques del micro-controlador, escriptures i lectures digitals i analògiques, i altres funcionalitats de més alt nivell.

source: S4A works in the three major consumer operating systems.
ca: S4A funciona sobre els tres sistemes operatius d'escriptori més populars.

source: Changed indexed primitives to named ones for better compatibility with new Squeak VMs (thanks to Miriam Ruiz for the patch)
ca: Primitives indexades canviades a primitives amb nom per a una millor compatibilitat amb les noves màquines virtuals d'Squeak (gràcies a Miriam Ruiz pel pedàs)

source: Scratch for Arduino (S4A) is a modified version of Scratch, ready to interact with Arduino boards.
ca: Scratch for Arduino (S4A) és una versió modificada d'Scratch, preparada per a interactuar amb plaques Arduino.

source: However, in the final user version some code has been compiled and you'll be missing several variable and message argument names, which is why we are also providing you with a clean source code image for developers, downloadable here:
ca: De tota manera, a la versió final d'S4A hi ha codi que ha estat compilat, i s'hauran perdut diversos noms de variables i arguments de missatges. Per aquest motiu, també distribuïm una imatge amb el codi font net per a desenvolupadors, descarregable des d'aquest enllaç:

source: While there, he had the opportunity to enter Citilab through an internship, where he later developed S4A, his final thesis.
ca: Durant aquest temps, va sorgir-li l'oportunitat d'entrar al Citilab a través d'una beca, on va desenvolupar S4A, el seu projecte final.

source: Will S4A work on my PC?
ca: Funcionarà S4A al meu ordinador?

source: http://[IP]:42001/broadcast=[message-name]
ca: http://[IP]:42001/broadcast=[nom-del-missatge]

source: S4A messages whose name doesn't start with a plus sign are not visible from the web client
ca: Els missatges S4A amb noms que no comencin amb un signe més no són visibles des del client web

source: This video serves as an introduction for the S4A workshops given at Citilab, but you'll find a couple of demos of what can be achieved with our software.
ca: Aquest vídeo serveix com a introducció pels tallers d'S4A que s'imparteixen al Citilab. Hi trobareu uns quants exemples de casos d'ús del nostre software.

source: You will first need to enable the remote sensors option in S4A (right click on any "Sensors" block).
ca: Abans de res, cal activar l'opció de sensors remots a S4A (clic dret a qualsevol bloc de "Sensors").

source: Domotics: A blind curtain controller
ca: Domòtica: Un controlador de persiana

source: Community
ca: Comunitat

source: Added server commands to "Edit" menu to manage network communication over sockets
ca: Afegides comandes de servidor al menú "Edita" per a treballar amb comunicació en xarxa sobre sockets

source: Contact
ca: Contacte

source: S4A - Scratch for Arduino is a Scratch modification that brings the easiness of programming with Scratch to the Arduino prototyping board
ca: S4A - Scratch for Arduino és una modificació d'Scratch que porta la facilitat de programar en Scratch a la placa de prototipatge Arguino

source: Changed default pin at digital on/off blocks from 13 to 10
ca: Canviat el pin per defecte dels blocs digital on/off de 13 a 10

source: S4A messages whose name starts with a plus sign (i.e. +startGame) are visible from the web client
ca: Els missatges S4A amb noms que comencin amb un signe més (ex. +iniciarJoc) són visibles des del client web

source: Robotics: A keyboard-driven car
ca: Robòtica: Un cotxe controlat per teclat

source: Supported boards
ca: Plaques compatibles

source: A robot with a rotative camera, distance sensors and a remote control.
ca: Un robot amb una càmera rotativa, sensors de distància i control remot.

source: Which boards does S4A support?
ca: Quines plaques són compatibles amb S4A?
